results = [10, 2, 5, 12, 11, 11, 4]
num = 0
for sum in results
  num = num + 1
  puts "Партия: #{num} / Выпало очков #{sum}}"
end
#Для класса Fixnum:
#    Метод, увеличивающий число на единицу
puts 11.next
puts 11.succ
#    Метод проверяющий является ли число нулём
puts 0.zero?
#    Метод возвращающий модуль числа
puts -12.abs
#
#Для класса Float:
#    Метод, округляющий вещественное число вниз до целой части

#    Метод, возвращающий результат деления 2-х чисел в виде массива с целой частью и остатком от деления
#
#Для класса String:
#
#    Метод, приводящий все символы в строке к нижнему регистру
#    Метод, возвращающий следующий символ за текущим (согласно кодам ASCII)
#    Метод изменяющий текущий объект строки, путём удаления предшествующих и завершающих пробельных символов
#
#Для класса Array:
#
#    Метод, удаляющий все встречающиеся элементы в массиве равные заданному
#    Метод, возвращающий текущий массив с элементами в случайном порядке
#    Метод, превращающий массив в строку путём объединения его элементов
#
#Для класса Hash:
#
#    Метод, проверяющий наличие заданного ключа в хэше
#    Метод, объединяющий 2 объекта хэшей
#
#Для класса Range:
#
#    Метод, возвращающий максимальное значение диапазона
